[
    {
        "id": "1",
        "nombreReceta": "Tiramisu",
        "imagenReceta": "https://media.istockphoto.com/id/585178794/es/foto/el-tiramis%C3%BA.jpg?s=612x612&w=0&k=20&c=crnmNlpdoueh9tL_EdaS1cZ2f08PZ2RGabpmO30JeTs=",
        "ingredientes": [
            {
                "ingrediente": "Azucar",
                "cantidad": "160gr"
            },
            {
                "ingrediente": "Crema de Leche o Nata",
                "cantidad": "160cc"
            },
            { 
                "ingrediente": "Marcarpone",
                "cantidad": "600gr"
            },
            {
                "ingrediente": "huevo",
                "cantidad": "7 yemas"
            },
            {
                "ingrediente": "Cafe",
                "cantidad": "1 taza"
            },
            {
                "ingrediente": "Paquetes de Vainillas",
                "cantidad": "2"
            },
            {
                "ingrediente": "Cacao Amargo"
            }
        ],
        "preparacion": [
            "Batir las yemas a baño María e incorporar el azúcar y el cognac o amaretto. Batimos por 5 minutos aproximadamente. Retirar del fuego y batir hasta que las yemas estén a temperatura ambiente. Van a notar que las yemas triplican su tamaño y hacerse una especie de crema.",
            "Batir un poco el mascarpone para que no tenga grumos",
            "Verter las yemas sobre el mascarpone e integrar con movimientos envolventes. Sumar la crema de leche semi batida y mezclar suavemente.",
            "Hidratar los bizcochos de tiramisú en el café.",
            "Disponer la primer capa vainillas en la fuente. Debe quedar una capa de vainillas, una de crema, una de vainillas y por último una de crema.",
            "Espolvoreamos por arriba el cacao amargo y el chocolate semi amargo rallado o picado y a la heladera!",
            "Retirar de la heladera, y listo para comer!"
        ]
    },
    {
        "id": "2",
        "nombreReceta": "Lemon Pie",
        "imagenReceta":"https://www.shutterstock.com/image-photo/slice-lemon-pie-isolated-on-260nw-773577262.jpg",
        "ingredientes": [
            {
                "ingrediente": "Galletitas de vainilla",
                "cantidad": "200gr"
            },
            {
                "ingrediente": "Manteca",
                "cantidad": "70gr"
            },
            {
                "ingrediente": "Huevos",
                "cantidad": "4"
            },
            {
                "ingrediente": "Leche condensada",
                "cantidad": "1 Lata"
            },
            {
                "ingrediente": "Jugo de limón",
                "cantidad": "1/2 vaso"
            },
            {
                "ingrediente": "Ralladura de Medio Limon"
            },
            {
                "ingrediente": "Azucar",
                "cantidad": "200gr"
            }
        ],
        "preparacion": [
            "Moler 200 gr de galletitas de vainilla y colocar en un recipiente.",
            "Agregar 80-100 gr de manteca derretida. Utilizamos las manos para mezclar hasta que quede con consistencia de arena mojada",
            "Desparramar la preparación obtenida en una tartera. Aplastarlo bien con las manos.",
            "Por otro lado la crema de limón: separamos yemas y claras de 4 huevos. Colocamos las yemas en un recipiente, agregamos una lata (400gr) de leche condensada y mezclar. Esta receta de lemon pie lleva medio vaso de jugo de limón que se lo agregamos en este momento, junto con rayadura de cáscara. Batimos hasta lograr una consistencia espesa.",
            "Agregamos la crema de limón encima de la masa que preparamos al principio en la tartera.",
            "Y ahora el merengue francés: empezamos batiendo las 4 claras con batidora hasta que levanten (como si fuera espuma). Agregamos 200 gr de azucar en forma de lluvia sin dejar de batir, seguimos batiendo hasta lograr la consistencia deseada (bien espeso).",
            "Agregamos el merengue encima de la crema de limón en la tartera. Con una cuchara distribuimos y damos al merengue la forma que deseamos.",
            "Poner al horno (en la bandeja más alta posible o en la parrilla del horno) bien caliente."
            
        ]
    },
    {
        "id": "3",
        "nombreReceta": "",
        "ingredientes": [
            {
                "ingrediente": "",
                "cantidad": ""
            },
            {
                "ingrediente": "",
                "cantidad": ""
            },
            {
                "ingrediente": "",
                "cantidad": ""
            }
        ],
        "preparacion": [
            "paso1",
            "paso2",
            "paso3"
        ]
    },
    {
        "id": "4",
        "nombreReceta": "",
        "ingredientes": [
            {
                "ingrediente": "",
                "cantidad": ""
            },
            {
                "ingrediente": "",
                "cantidad": ""
            },
            {
                "ingrediente": "",
                "cantidad": ""
            }
        ],
        "preparacion": [
            "paso1",
            "paso2",
            "paso3"
        ]
    },
    {
        "id": "5",
        "nombreReceta": "",
        "ingredientes": [
            {
                "ingrediente": "",
                "cantidad": ""
            },
            {
                "ingrediente": "",
                "cantidad": ""
            },
            {
                "ingrediente": "",
                "cantidad": ""
            }
        ],
        "preparacion": [
            "paso1",
            "paso2",
            "paso3"
        ]
    }
]